<a href="https://colab.research.google.com/github/nikonovvas/Nikonon19-20/blob/main/%D0%9D%D0%B8%D0%BA%D0%BE%D0%BD%D0%BE%D0%B2_%D0%92_%D0%90_%D0%9E%D1%81%D0%BE%D0%B7%D0%BD%D0%B0%D0%BD%D0%BD%D1%8B%D0%B9_%D0%BF%D1%80%D0%BE%D0%B5%D0%BA%D1%8206_03_2021).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#import packages

In [3]:
import pandas as pd
import numpy as np
from IPython.display import display

#data import

In [9]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header= None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [10]:
names=["id","RI","Na","Mg","Al","si","K","Ca","Ba","Fe","Class"]
data.columns = names
data= data.drop(columns=["id"])
data.head(3)

        RI     Na    Mg    Al     si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [12]:
data["Class"].replace(
                      {1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps",
                       }, inplace=True)

In [16]:
data.head(100)

         RI     Na    Mg    Al  ...    Ca    Ba    Fe               Class
0   1.52101  13.64  4.49  1.10  ...  8.75  0.00  0.00      building_float
1   1.51761  13.89  3.60  1.36  ...  7.83  0.00  0.00      building_float
2   1.51618  13.53  3.55  1.54  ...  7.78  0.00  0.00      building_float
3   1.51766  13.21  3.69  1.29  ...  8.22  0.00  0.00      building_float
4   1.51742  13.27  3.62  1.24  ...  8.07  0.00  0.00      building_float
..      ...    ...   ...   ...  ...   ...   ...   ...                 ...
95  1.51860  13.36  3.43  1.43  ...  8.60  0.00  0.00  building_non_float
96  1.51841  13.02  3.62  1.06  ...  9.13  0.00  0.15  building_non_float
97  1.51743  12.20  3.25  1.16  ...  8.90  0.00  0.24  building_non_float
98  1.51689  12.67  2.88  1.71  ...  8.54  0.00  0.00  building_non_float
99  1.51811  12.96  2.96  1.43  ...  8.79  0.14  0.00  building_non_float

[100 rows x 10 columns]

In [17]:
for col in data.columns:
  fr= np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col]=np.nan
data.head(3)

        RI     Na    Mg    Al     si     K    Ca   Ba   Fe           Class
0      NaN  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48   NaN  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float

#Data Vizualization

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      195 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      203 non-null    float64
 3   Al      201 non-null    float64
 4   si      195 non-null    float64
 5   K       203 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      197 non-null    float64
 8   Fe      197 non-null    float64
 9   Class   195 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [19]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  195.000000  199.000000  203.000000  ...  195.000000  197.000000  197.000000
mean     1.518374   13.413869    2.675468  ...    8.963590    0.167005    0.057360
std      0.003130    0.823434    1.446026  ...    1.389973    0.466234    0.097693
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516460   12.915000    1.985000  ...    8.255000    0.000000    0.000000
50%      1.517630   13.290000    3.480000  ...    8.610000    0.000000    0.000000
75%      1.519220   13.840000    3.600000  ...    9.165000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [27]:
display(data["Class"].describe())
print("____________________________________")
display(data["Class"].value_counts())

count                    195
unique                     6
top       building_non_float
freq                      74
Name: Class, dtype: object

____________________________________

building_non_float    74
building_float        62
headlamps             26
containers            12
vehicle_float         12
tableware              9
Name: Class, dtype: int64